
Orion t^2 project based on Rubin's 2012 WFC3 data

* Again revisited [2013-12-19 Thu]

** Save the ipython notebook with the Rubin STIS slit calculations
#+BEGIN_SRC sh :results verbatim
ipython nbconvert "Rubin STIS Spectra.ipynb"
#+END_SRC

#+RESULTS:

#+BEGIN_SRC sh :results verbatim
ipython nbconvert --help
#+END_SRC

#+RESULTS:
#+begin_example
This application is used to convert notebook files (*.ipynb) to various other
formats.

WARNING: THE COMMANDLINE INTERFACE MAY CHANGE IN FUTURE RELEASES.

Options
-------

Arguments that take values are actually convenience aliases to full
Configurables, whose aliases are listed on the help line. For more information
on full configurables, see '--help-all'.

--stdout
    Write notebook output to stdout instead of files.
--init
    Initialize profile with default config files.  This is equivalent
    to running `ipython profile create <profile>` prior to startup.
--quiet
    set log level to logging.CRITICAL (minimize logging output)
--debug
    set log level to logging.DEBUG (maximize logging output)
--profile=<Unicode> (BaseIPythonApplication.profile)
    Default: 'default'
    The IPython profile to use.
--post=<DottedOrNone> (NbConvertApp.post_processor_class)
    Default: ''
    PostProcessor class used to write the  results of the conversion
--config=<Unicode> (BaseIPythonApplication.extra_config_file)
    Default: ''
    Path to an extra config file to load.
    If specified, load this config file in addition to any other IPython config.
--output=<Unicode> (NbConvertApp.output_base)
    Default: ''
    overwrite base name use for output files. can only  be use when converting
    one notebook at a time.
--ipython-dir=<Unicode> (BaseIPythonApplication.ipython_dir)
    Default: '/Users/will/.ipython'
    The name of the IPython directory. This directory is used for logging
    configuration (through profiles), history storage, etc. The default is
    usually $HOME/.ipython. This options can also be specified through the
    environment variable IPYTHONDIR.
--to=<CaselessStrEnum> (NbConvertApp.export_format)
    Default: 'html'
    Choices: ['custom', 'html', 'latex', 'markdown', 'python', 'rst', 'slides']
    The export format to be used.
--template=<Unicode> (Exporter.template_file)
    Default: 'default'
    Name of the template file to use
--log-level=<Enum> (Application.log_level)
    Default: 30
    Choices: (0, 10, 20, 30, 40, 50, 'DEBUG', 'INFO', 'WARN', 'ERROR', 'CRITICAL')
    Set the log level by value or name.
--writer=<DottedObjectName> (NbConvertApp.writer_class)
    Default: 'FilesWriter'
    Writer class used to write the  results of the conversion
--profile-dir=<Unicode> (ProfileDir.location)
    Default: ''
    Set the profile location directly. This overrides the logic used by the
    `profile` option.

To see all available configurables, use `--help-all`

Examples
--------

    The simplest way to use nbconvert is
    
    > ipython nbconvert mynotebook.ipynb
    
    which will convert mynotebook.ipynb to the default format (probably HTML).
    
    You can specify the export format with `--to`.
    Options include ['custom', 'html', 'latex', 'markdown', 'python', 'rst', 'slides']
    
    > ipython nbconvert --to latex mynotebook.ipnynb
    
    Both HTML and LaTeX support multiple output templates. LaTeX includes
    'basic', 'book', and 'article'.  HTML includes 'basic' and 'full'.  You 
    can specify the flavor of the format used.
    
    > ipython nbconvert --to html --template basic mynotebook.ipynb
    
    You can also pipe the output to stdout, rather than a file
    
    > ipython nbconvert mynotebook.ipynb --stdout
    
    A post-processor can be used to compile a PDF
    
    > ipython nbconvert mynotebook.ipynb --to latex --post PDF
    
    You can get (and serve) a Reveal.js-powered slideshow
    
    > ipython nbconvert myslides.ipynb --to slides --post serve
    
    Multiple notebooks can be given at the command line in a couple of 
    different ways:
    
    > ipython nbconvert notebook*.ipynb
    > ipython nbconvert notebook1.ipynb notebook2.ipynb
    
    or you can specify the notebooks list in a config file, containing::
    
        c.NbConvertApp.notebooks = ["my_notebook.ipynb"]
    
    > ipython nbconvert --config mycfg.py

#+end_example

** DONE Recheck the EW of Orion and Ring Nebula
CLOSED: [2013-12-21 Sat 11:26]
+ [[file:EW(%5BN%20II%5D%205755).ipynb][This ipython notebook]] has the calculations
+ Bottom line is 3 \AA EW for [N II] 5755 \AA in Orion
+ But that is for far-out regions.  In the Rubin slit we have 5 to 15 \AA
+ And 100 \AA in the Ring Nebula
** TODO Use Bally STIS slit for better estimate of color term
+ Pixel scale is 2.746 \AA
+ Each line is about 100 \AA wide due to 2 arcsec slit
*** Lines that we can see in the G430L spectrum
+ NOT [N II] 5755
  + Unfortunately, this is just off the red side of the spectrum
+ [Cl III] 5518,38
  + Both of roughly equal strength
+ [Fe III] 5270
+ [N I] 5198,200
+ Other weak lines blending together
+ Overlap (very strong)
  + H\beta 4861
  + [O III] 4959
  + [O III] 5007
+ Overlap (similar strength)
  + He I 4713
  + [Fe III] 4658
  + The F469N (53.1 \AA) filter is 4662.25 \to 4715.35
    + So the lines are at the edges of the filters
    + We need to take into account that the filters are given in vacuum wavelengths
+ Overlap
  + He I 4471 (roughly 4 x stronger than 4363)
  + He I 4388 (2 \to 3 times weaker than 4363)
    + a tiny perturbation to 4471
  + H\gamma 4340 + [O III] 4363
    + The 4363 line can be seen as a slight bump on the blue side of the 4471 line
    + Also as a similar bump on 4340, but harder to see since 4340 is brighter
+ Overlap
  + H\delta 4101 strong
  + He I 4026
  + [S II] 
*** DONE Remove CRs with spotless.py
CLOSED: [2014-01-05 Sun 17:04]
#+BEGIN_SRC sh :results verbatim
cp /Users/will/Work/HST-STIS/Bally8324/o5gf57010_sx2.fits bally-stis-hst10-g430l.fits
python ~/Work/HST-STIS/spotless/spotless.py --data-range 0 3e-15 --multi-hdu --allow-shadows --output-id cr --include-regions-from-file bally-stis-hst10-g430l-badpix.reg --verbose --debug bally-stis-hst10-g430l
#+END_SRC

#+RESULTS:
#+begin_example
Finding bad pixels by the 'edge' method
Data scaled to range [0.00e+00, 3.00e-15]
Edge detection with Canny method complete
Filling of holes complete
WARNING: FITSFixedWarning: 'unitfix' made the change 'Changed units: 'angstrom' -> 'Angstrom''. [astropy.wcs.wcs]
Regions from bally-stis-hst10-g430l-badpix.reg added to bad pixels
Number of bad pixels: 91131 (6.318% of total)
Number of distinct bad pixel objects found: 245
Number of objects skipped:  4
Replacement of bad pixels complete
WARNING: Overwriting existing file 'bally-stis-hst10-g430l-cr.fits'. [astropy.io.fits.hdu.hdulist]
#+end_example

This is not perfect, but it will do for now

*** 
** DONE Use of the Rubin STIS slits to estimate color term
CLOSED: [2014-01-04 Sat 00:24]
+ We find a color correction of 0.93 in [[file:Rubin%20STIS%20spectra.ipynb][this ipynb file]]
  + There is no evidence that it varies with EW
  + On the other hand, there is the slight worry that the STIS spectra do not cover the entire spectral range of F547M
    + F547M has \lambda_{0} = 5447 \AA and \Delta\lambda = 650 \AA, so 5122 \to 5772 \AA
    + The STIS spectra go from 5448 upwards, so the bluemost extent is the center of the band
    + We are missing the short wavelength half of its bandpass (5122 \to 5448), which has 30% higher transmission than the long wavelength half that we have (5448 \to 5772)
    + We do have a bluer spectrum covering the range 4820 \to 5100
      + [X] We could test the range 5020 \to 5100 to see if that has any variation wrt 5448 \to 5772
        + Too noisy to be of much use
      + [X] Also look for any other STIS spectra in the archive
        + Bally spectrum is best

+ These /do not quite/ overlap with our region
+ [X] Work out which slits I need
+ [X] Combine pairs to remove cosmic rays
  + [X] Need to use spotless too
  + Final file =rubin-stis-slit1-5734-merge-cr.fits=
+ [X] CANCELED Take slice through the WFC3 images to compare with the different filters
  + Not so useful since no overlap with quad filters
*** DONE Using spotless on the STIS spectrum
CLOSED: [2013-12-31 Tue 16:42]

#+BEGIN_SRC sh :results verbatim
python ~/Work/HST-STIS/spotless/spotless.py --data-range 5e-15 1e-13 --use-log-scale --multi-hdu --output-id cr --verbose --debug --allow-shadows rubin-stis-slit1-5734-merge
#+END_SRC

#+RESULTS:
Finding bad pixels by the 'edge' method
Data scaled to range [5.00e-15, 1.00e-13]
Edge detection with Canny method complete
Filling of holes complete
Number of bad pixels: 8686 (0.602% of total)
Number of distinct bad pixel objects found: 216
Number of objects skipped:  3
Replacement of bad pixels complete
WARNING: Overwriting existing file 'rubin-stis-slit1-5734-merge-cr.fits'. [astropy.io.fits.hdu.hdulist]

#+BEGIN_SRC sh :results verbatim
python ~/Work/HST-STIS/spotless/spotless.py --data-range 5e-15 1e-13 --use-log-scale --multi-hdu --output-id cr --verbose --debug --allow-shadows rubin-stis-slit1-6581-merge
#+END_SRC

#+RESULTS:
: Finding bad pixels by the 'edge' method
: Data scaled to range [5.00e-15, 1.00e-13]
: Edge detection with Canny method complete
: Filling of holes complete
: Number of bad pixels: 30888 (2.141% of total)
: Number of distinct bad pixel objects found: 285
: Number of objects skipped:  25
: Replacement of bad pixels complete

#+BEGIN_SRC sh :results verbatim
python ~/Work/HST-STIS/spotless/spotless.py --data-range 0 5e-13 --multi-hdu --allow-shadows --output-id cr --verbose --debug rubin-stis-slit1-4961-merge
#+END_SRC

#+RESULTS:
: Finding bad pixels by the 'edge' method
: Data scaled to range [0.00e+00, 5.00e-13]
: Edge detection with Canny method complete
: Filling of holes complete
: Number of bad pixels: 30343 (2.104% of total)
: Number of distinct bad pixel objects found: 73
: Number of objects skipped:  5
: Replacement of bad pixels complete
: WARNING: Overwriting existing file 'rubin-stis-slit1-4961-merge-cr.fits'. [astropy.io.fits.hdu.hdulist]



**** Help for spotless.py
#+BEGIN_SRC sh :results verbatim
python ~/Work/HST-STIS/spotless/spotless.py --help
#+END_SRC

#+RESULTS:
#+begin_example
usage: spotless.py [-h] [--hdu-index HDU_INDEX] [--output-id OUTPUT_ID]
                   [--method {thresh,edge,segment}] [--onlybadpix]
                   [--threshold THRESHOLD] [--dmax DMAX] [--ddmax DDMAX]
                   [--data-range MIN MAX] [--use-log-scale]
                   [--segment-pars LO HI]
                   [--edge-pars SIGMA LOW_THRESHOLD HIGH_THRESHOLD]
                   [--thick-edges] [--reject-filaments] [--allow-shadows]
                   [--clip-negative]
                   [--exclude-regions-from-file EXCLUDE_REGIONS_FROM_FILE]
                   [--include-regions-from-file INCLUDE_REGIONS_FROM_FILE]
                   [--verbose] [--debug] [--multi-hdu]
                   fitsfile

Remove cosmic rays and other bad pixels from an image

positional arguments:
  fitsfile              Name of image FITS file (sans extension)

optional arguments:
  -h, --help            show this help message and exit
  --hdu-index HDU_INDEX
                        Which HDU to use from the FITS file (default: 0)
  --output-id OUTPUT_ID
                        Extra string to add to output filenames to aid in
                        layer identification (default: )
  --method {thresh,edge,segment}
                        Algorithm to use to find the bad pixels (default:
                        edge)
  --onlybadpix          Only calculate the bad pixel map - do not replace
                        pixels in the image (default: False)
  --threshold THRESHOLD
                        Assume any pixel above this level is bad (default:
                        None)
  --dmax DMAX           Maximum diameter of features to zap. Leave alone any
                        roughly circular objects that are larger than this.
                        (default: 5)
  --ddmax DDMAX         Absolute maximum diameter of features to zap. Leave
                        alone any objects that are larger than this, whatever
                        their shape may be. (default: 10)
  --data-range MIN MAX  Range for data scaling (default: None)
  --use-log-scale       Use logarithmic data scaling (default: False)
  --segment-pars LO HI  For 'segment' method only: thresholds of scaled data
                        to seed the good/bad regions (default: (0.0, 1.0))
  --edge-pars SIGMA LOW_THRESHOLD HIGH_THRESHOLD
                        For 'edge' method only: parameters for the Canny edge
                        detection algorithm. See: http://scikits-
                        image.org/docs/dev/auto_examples/plot_canny.html
                        (default: (1.0, 0.1, 0.2))
  --thick-edges         Make the edges be 3 pixels wide instaed of the default
                        1 (default: False)
  --reject-filaments    Try to reject objects that look filamentary, since
                        they are probably not cosmic rays (default: False)
  --allow-shadows       Also remove objects that are darker than their
                        surroudings (not generally advised, especially if you
                        have dark globules in your image!) (default: False)
  --clip-negative       Also remove all negative pixels (default: False)
  --exclude-regions-from-file EXCLUDE_REGIONS_FROM_FILE
                        Read DS9 regions from a file, which are to be marked
                        as definite good pixels (default: None)
  --include-regions-from-file INCLUDE_REGIONS_FROM_FILE
                        Read DS9 regions from a file, which are to be marked
                        as definite bad pixels (default: None)
  --verbose, -v         Print informative progress messages (default: False)
  --debug, -d           Save auxiliary images of intermediate steps (default:
                        False)
  --multi-hdu, -m       Work in multi-HDU mode. This assumes that the image is
                        in the "SCI" HDU in the input file (the argument
                        --hdu-index is ignored). All additional HDUs in the
                        input file are copied through to the output file. Only
                        one output file is written, all auxilliary arrays
                        ("edges", "labels", "badpix", etc) are written as
                        additional HDUs in the same file. (default: False)
#+end_example

*** Mail that I sent [2013-12-20 Fri]
#+BEGIN_QUOTE
A little later than promised due to family commitments, but I have managed to get some work done on this project.  I decided to go back to the beginning and make sure I was getting the fundamentals right.  So I have been checking the value of the Equivalent Width of [N II] 5755 from various datasets that I have lying around (Keck and STIS).  I also have calculated it for the Ring Nebula from the SPM B&Ch spectra. 

The bottom line is that for multiple positions in Orion, EW(5755) = 3 Angstrom.  Whereas in the main ring of the Ring Nebula, EW(5755) = 100 Angstrom.  These should be compared with the nominal width of the FQ575N filter of WFC3, which is 20.6 Angstrom.

What this means is that our Ring Nebula paper is safe because the continuum contamination of the [N II] auroral line filter is small (~ 20%).  In Orion, on the other hand, the FQ575N filter is dominated by continuum, which is 6 times stronger than the emission line that we want to measure.

This means that if we want to know the [N II] line intensity to a precision of (say) 10%, then we need to know the continuum to a precision of better than 2%. 

So, what I plan on doing next is to check how precisely we can estimate the continuum around 5755 Ang using the filters we have: F547M and F469N.  I plan to do this by comparison with STIS spectra that Bob Rubin obtained many years ago (published in 2003MNRAS.340..362R - Gary is a coauthor).  One of his slit positions overlaps our WFC3 Orion S field and includes the ranges 4308-4594, 4818-5104, and 5448-6020.  So the spectra cover half of the F547M bandpass and they straddle the F469N bandpass but unfortunately do not include it.  Therefore, they should be fine for looking at spatial variations in the continuum color, but will not help us in estimating the line contamination of F469N. 

Of course, the same spectra will also allow a direct comparison of the 5755 intensity with our WFC3 measurements where they overlap, and I think this is worth doing too. 
#+END_QUOTE

** Using the 469 filter to estimate the color term
** Write up calculation of the filter calibration

* Revisiting this project [2013-08-04 Sun]

+ Main aim is to assess whether we can measure t^2([N II]) or not.
+ First task is to accurately measure the 5755/6584 ratio
  + The main problem is that the 5755 line only contributes about 10% to the FQ575N filter.  The remainder is continuum.  So that continuum needs to be measured and subtracted very accurately.
  + Secondary problem is extinction
+ Second task is to find T([N II]) and t^2 from the 5755/6584 ratio
  + Bob has some of the complications described in [[file:record]]
  + Circular dependence of reddening on T via intrinsic Hb/Ha ratio
  + Dependence of T(N II) on density:
    + t(NII)=2.5/{longRNII - 2.108 + [1 + 4.4E-5Ne/t^1/2]}
    + Density varies from 1000 to 6000 cm^{-3}
      |    n |           |
      |------+-----------|
      | 1000 | 1.0429058 |
      | 6000 | 1.2574349 |
      #+TBLFM: $2=1 + 4.5e-5 $1 / sqrt(1.1)



* The C(Hb) map

+ Strangely, this is consistently higher by about 0.3 with respect to the previous maps, such as O'Dell & Yusef-Zadeh (2000)

* The [N II] temperature map

The main issue here is the correction for the underlying continuum. 

+ In the Ring Nebula EW(Hb) = 800 Angstrom and is roughly constant in the inner region (drops at the outside, where dust scattering becomes important)
+ In Orion, the EW is smaller: roughly 400 Angstrom in the inner regions, but varying strongly with position
+ From O'Dell & Harris we have spectrophotometry
  + The relevant regions are the western portions of slits 11 and 12
  + 

|          |  11-west |  12-west |
|----------+----------+----------|
| c(Hb)    |     0.26 |     0.37 |
| S(Hb)    | 3.25E−13 | 3.93E−13 |
| EW(Hb)   |      380 |      400 |
| NII 5755 |   0.0039 |   0.0032 |
| NII 6584 |   0.3792 |   0.2964 |
| EW(5755) |    1.482 |     1.28 |
| EW(6584) |  144.096 |   118.56 |
#+TBLFM: @7$2..@8$3=@-2 @4
 

** Factors affecting the 5755/6584 determination

*** Spatial variations in the continuum color

+ Bob's =k= term
  + Defined as 
: flux ratio of the continuum (in wavelength intervals) at the line
: filter wavelength and at 547 nm


**** Fig 2 of O'Dell & Harris
+ The spectrum rises towards the blue, even though it is not de-reddened
+ The E sample (EW=190) is bluer than the 12-mid sample (EW=430)
+ Between 547 and 575 there is only a small difference
  + I measure about 0.06 dex for 12-mid
    + Corresponds to a ratio of k = 10**-0.06 = 0.87
    + So even this is significantly different from unity
  + This will have a potentially large effect since EW(5755) is small
+ Between 547 and 658 the difference is a bit larger



**** Evidence from the 469/547 ratio
+ The 469 filter is potentially contaminated by [Fe III] 4701.53 and He I 4713.139, so we have to be careful
  + Baldwin has fluxes as follows
    | lambda(obs) | lambda_0 | Ion      | delta V | FWHM |  I/6678 | Icorr/6678 |     S/N | Notes   |
    |-------------+----------+----------+---------+------+---------+------------+---------+---------|
    |    4701.603 |  4701.53 | [Fe III] |     4.6 |   14 |  0.0390 |     0.0559 |   188.8 |         |
    |    4713.164 | 4713.139 | He I     |     1.5 |   19 |  0.1340 |     0.1916 |   354.3 | average |
    |    4861.334 |  4861.33 | H\beta   |     0.2 |   26 | 17.4964 |    24.2016 | 62680.0 |         |
  + So, assuming H beta EW is 400 Angstrom, we get EWs for the two lines of 400 [0.0559, 0.1916]/24.2016 = [0.924, 3.167] Angstroms
  + The filter width is 53.1 Angstrom according to Bob
    + In addition, the He I line falls on the red flank of the filter, where the transmission is about 0.12, which is 0.6 times the peak
    + Although it will be very sensitive to the heliocentric correction since we are on a very steep part of the transmission curve.
  + So the fractional contribution of the He I line should be 0.6 3.167 / 53.1 = 0.0358 => only about 3.5%
  + The [Fe III] line has a transmission of 0.19 = 0.95 times peak, giving a fractional contribution of 0.95 0.924 / 53.1 = 0.016, which is 1.6%
  + So, in *normal* circumstances the line contamination of F469N should be about 5% when EW(Hb) = 400 Angstrom
    + And would be even less when the EW(Hb) is lower
  + An exception will be from shocked regions that have much enhanced [Fe III] emission
    + For example HH202 from Mesa Delgado et al (2012)
      + The nebular component has flux 0.237 on scale Hb=100 (similar to Baldwin)
      + The shock component has flux 3.915 on scale Hb=100
	+ For Hb:
	  + shock = (6.00±0.20) ×10−12 erg cm−2 s−1
	  + nebula = (3.80±0.20)×10−12 erg cm−2 s−1
	+ So, if we did not resolve the 2 components we would get
	  + 100 I([Fe III]) / I(Hb) =  (6.00 3.915 + 3.80 0.237)/(6.00 + 3.80) = 2.49
	  + So if EW(Hb) = 400, we would have EW([Fe III]) = 400 2.49 / 100 = 9.96
      + So fractional contribution of shocked [Fe III] to F469N is 0.95 9.96 / 53.1 = 0.178
	+ => nearly 20%
    + We can compare this with the excess in 469/547 seen at the position of the HH529 counterflow, which is about 10%
      + So this is not quite as extreme as in HH202, possible because the shock component is not as strong relative to the nebular component
  + Bob estimates (in Ring paper, penultimate para of appendix) that up to 10% of the 469 signal may be from lines (principally He I).
    + I get only half this value (/see above/) 
  + In principle, this could be corrected for if we had observations of another He line.... we don't
  + On the other hand, to zeroth order the He I will follow H I, which in turn follows the Paschen continuum
  + This means that /variations/ in 469/547 are unlikely to be due to the He I line
    + Except for enhanced [Fe III] emission from shocks, which is seen in two or three very localised regions
  + But apart from that, it should be telling us the continuum color
  + It shows peak-to-peak variations of about 20% in the "interesting" (NW) zone, and about 10% in the more boring (SE) zone
  + The ratio 469/547 is /negatively/ correlated with 487/547, which is to first order the EW of Hb
    + That is, the continuum is bluer when EW(Hb) is lower
    + This is what we expect, since the continuum color should be bluer in regions where the scattered continuum is higher
    + It is the /opposite/ of what one would expect if line contamination of 469 were a serious issue
      + Since in that case, the line contamination should be relatively higher when there is less continuum to dilute it
      + Which implies 469/547 should go up when 487/547 goes up, which is not observed.
    + 487/547 shows peak-to-peak variations of order 50% in the NW zone, and 20% in the SE zone


* Useful data
** WFC3 filters

*** Useful continuum filters

Which lines are in which filters?

| Name   | Description    | Pivot λp (nm) | Width (nm) | Peak System Throughput |  lam_1 |  lam_2 |
| 1      | 2              |             3 |          4 |                        |        |        |
|--------+----------------+---------------+------------+------------------------+--------+--------|
| F467M  | Strömgren b    |         468.3 |       20.1 |                   0.28 | 4582.5 | 4783.5 |
| F547M  | Strömgren y    |         544.7 |       65.0 |                   0.26 | 5122.0 | 5772.0 |
| FQ634N | 6194 continuum |         634.9 |        6.4 |                   0.26 | 6317.0 | 6381.0 |
| F645N  | Continuum      |         645.4 |        8.4 |                   0.25 | 6412.0 | 6496.0 |
#+TBLFM: $6=10 ($3 - 0.5 $4) ; f1::$7=10 ($3 + 0.5 $4) ; f1

**** F467M Strömgren b 4582-4783 (W=201 A)

+ This is 4 times broader than F469N, which helps to dilute the lines.
+ But, the sum of the lines are 3 times higher flux!
  + So we don't gain much
  + The majority are He I and [Fe III]

|----------+----------+----------+---+------+----+--------+--------+-------+---------------------------------------------------------------------|
| 4571.200 | 4571.096 | Mg I     |   |  6.9 | 19 | 0.0014 | 0.0021 |   7.4 | the strongest semiforbidden optical line                            |
| 4590.972 | 4590.974 | O II     |   | -0.2 | 13 | 0.0040 | 0.0059 |  27.2 |                                                                     |
| 4596.175 | 4596.177 | O II     |   | -0.1 | 14 | 0.0032 | 0.0047 |  21.3 |                                                                     |
| 4597.048 |  4596.84 | [Ni III] |   | 13.6 | 18 | 0.0019 | 0.0028 |  10.5 |                                                                     |
| 4601.472 | 4601.478 | N II     |   | -0.4 | 15 | 0.0025 | 0.0037 |  15.9 |                                                                     |
| 4602.080 | 4602.129 | O II     |   | -3.2 | 20 | 0.0015 | 0.0022 |   7.5 |                                                                     |
| 4607.114 |  4607.03 | [Fe III] |   |      | 14 | 0.0094 | 0.0138 |  57.1 |                                                                     |
|          | 4607.153 | N II     |   |      |    |        |        |       |                                                                     |
| 4609.440 | 4609.436 | O II     |   |  0.3 | 19 | 0.0023 | 0.0034 |   9.9 |                                                                     |
| 4613.848 | 4613.868 | N II     | ? | -1.3 |  9 | 0.0015 | 0.0022 |   8.2 | average; anomalously low FWHM                                       |
| 4621.355 | 4621.418 | Si II    |   |      | 21 | 0.0030 | 0.0044 |   7.3 | average                                                             |
|          | 4621.696 | Si II    |   |      |    |        |        |       | observed line might include Si II triplet                           |
|          | 4621.722 | Si II    |   |      |    |        |        |       |                                                                     |
|          | 4621.570 | [C I]    |   |      |    |        |        |       |                                                                     |
|          | 4621.393 | N II     |   |      |    |        |        |       | main contributor                                                    |
| 4628.294 | 4628.046 | [Ni II]  | ? | 16.1 |  9 | 0.0008 | 0.0012 |   4.7 | anomalously low FWHM                                                |
| 4630.536 | 4630.539 | N II     |   |      | 14 | 0.0076 | 0.0111 |  37.2 |                                                                     |
|          |  4630.61 | N III    |   |      |    |        |        |       |                                                                     |
| 4634.072 |  4634.13 | N III    | ? | -3.8 | 13 | 0.0008 | 0.0012 |   5.2 | from multiplet with strongest line at 4640.64                       |
| 4638.841 | 4638.856 | O II     |   | -0.9 | 14 | 0.0083 | 0.0121 |  53.9 |                                                                     |
| 4640.569 |  4640.64 | N III    |   | -4.6 | 13 | 0.0013 | 0.0019 |   9.0 | from multiplet with strongest line at 4640.64                       |
| 4641.806 | 4641.810 | O II     |   | -0.3 | 14 | 0.0166 | 0.0241 | 109.0 |                                                                     |
| 4643.086 | 4643.086 | N II     |   |  0.0 | 15 | 0.0037 | 0.0054 |  22.5 |                                                                     |
| 4649.133 | 4649.135 | O II     |   | -0.1 | 14 | 0.0266 | 0.0386 | 171.5 | this is the strongest line of the multiplet; all lines are observed |
| 4650.827 | 4650.838 | O II     |   | -0.7 | 13 | 0.0081 | 0.0117 |  54.9 |                                                                     |
| 4658.149 |  4658.05 | [Fe III] |   |  6.4 | 15 | 0.1246 | 0.1804 | 844.6 |                                                                     |
| 4661.621 | 4661.632 | O II     |   | -0.7 | 14 | 0.0091 | 0.0132 |  67.4 |                                                                     |
| 4667.047 |  4667.01 | [Fe III] |   |  2.4 | 16 | 0.0050 | 0.0072 |  35.9 |                                                                     |
| 4673.720 | 4673.733 | O II     |   | -0.8 | 13 | 0.0014 | 0.0020 |  11.5 |                                                                     |
| 4676.224 | 4676.235 | O II     |   | -0.7 | 16 | 0.0060 | 0.0087 |  43.5 | cosmic ray hit on wing                                              |
| 4696.317 | 4696.353 | O II     | ? | -2.3 | 15 | 0.0011 | 0.0016 |   5.9 | weakest line from multiplet 4649.135                                |
| 4699.167 | 4699.011 | O II     |   |      | 23 | 0.0022 | 0.0032 |   7.5 |                                                                     |
|          | 4699.218 | O II     |   |      |    |        |        |       |                                                                     |
| 4701.603 |  4701.53 | [Fe III] |   |  4.6 | 14 | 0.0390 | 0.0559 | 188.8 |                                                                     |
| 4705.358 | 4705.346 | O II     |   |  0.8 | 13 | 0.0030 | 0.0043 |  14.2 |                                                                     |
| 4711.331 |  4711.37 | [Ar IV]  |   | -2.5 | 13 | 0.0109 | 0.0156 |  38.9 | average                                                             |
| 4713.164 | 4713.139 | He I     |   |  1.5 | 19 | 0.1340 | 0.1916 | 354.3 | average                                                             |
| 4728.294 | 4728.068 | [Fe II]  | ? | 14.3 | 14 | 0.0011 | 0.0016 |   7.0 | possible line from multiplet with 4889.617                          |
| 4733.937 |  4733.91 | [Fe III] |   |  1.7 | 15 | 0.0166 | 0.0236 | 100.8 |                                                                     |
| 4740.188 |  4740.17 | [Ar IV]  |   |  1.1 | 13 | 0.0125 | 0.0178 |  92.5 |                                                                     |
| 4752.953 | 4752.691 | O II     | ? | 16.5 | 22 | 0.0016 | 0.0023 |   8.1 |                                                                     |
| 4754.776 |  4754.69 | [Fe III] |   |  5.4 | 15 | 0.0232 | 0.0329 | 161.6 |                                                                     |
| 4756.469 |          |          | ? |      | 21 | 0.0021 | 0.0030 |  11.1 |                                                                     |
| 4762.400 |          |          | ? |      | 21 | 0.0010 | 0.0014 |   5.6 |                                                                     |
| 4769.496 |  4769.43 | [Fe III] |   |  4.2 | 15 | 0.0136 | 0.0192 |  88.4 |                                                                     |
| 4774.942 | 4774.718 | [Fe II]  |   | 14.1 | 13 | 0.0012 | 0.0017 |   8.3 | from multiplet with strongest line at 4814.534                      |
| 4777.734 |  4777.68 | [Fe III] |   |  3.4 | 14 | 0.0080 | 0.0113 |  53.4 |                                                                     |
| 4779.715 | 4779.722 | N II     |   | -0.4 | 14 | 0.0014 | 0.0020 |   9.6 |                                                                     |
| 4788.139 | 4788.138 | N II     |   |  0.0 | 17 | 0.0020 | 0.0028 |  12.1 |                                                                     |
| 4789.611 |  4789.45 | [F II]   | ? | 10.1 | 16 | 0.0009 | 0.0013 |   5.3 |                                                                     |
| 4792.073 | 4792.007 | S II     | ? |  4.2 | 23 | 0.0010 | 0.0014 |   4.3 |                                                                     |
| 4793.839 | 4793.648 | N II     | ? | 12.0 | 25 | 0.0019 | 0.0027 |   7.7 | several lines of this multiplet are observed                        |
| 4802.489 |          |          | ? |      | 15 | 0.0017 | 0.0024 |   8.6 |                                                                     |
| 4803.267 | 4803.287 | N II     |   | -1.2 | 12 | 0.0023 | 0.0032 |  13.2 | the same multiplet as 4774, 4779, 4781, 4788, 4793, 4810            |
| 4814.741 | 4814.534 | [Fe II]  |   | 12.9 | 18 | 0.0086 | 0.0120 |  28.5 | average; from multiplet with strongest line at 4814.534             |
| 4815.563 | 4815.617 | N II     |   |      | 17 | 0.0030 | 0.0042 |  10.3 | average                                                             |
|          | 4815.552 | S II     |   |      |    | 0.0024 |        |       |                                                                     |
|----------+----------+----------+---+------+----+--------+--------+-------+---------------------------------------------------------------------|
|          |          |          |   |      |    |        |  0.783 |       |                                                                     |
     #+TBLFM: @58$8=vsum(@I..@II)

**** F547M Strömgren y 5122-5772
|----------+----------+----------+---+------+----+--------+--------+--------+--------------------------------------------------------------------------|
| 5121.856 | 5121.828 | C II     |   |  1.7 | 17 | 0.0018 | 0.0024 |   11.3 | B                                                                        |
| 5131.924 |          |          | ? |      | 19 | 0.0013 | 0.0017 |    6.0 | B                                                                        |
| 5146.890 | 5146.749 | Co I     | ? |  8.2 | 17 | 0.0049 | 0.0064 |    8.9 | R                                                                        |
| 5146.917 | 5146.749 | Co I     | ? |  9.8 | 18 | 0.0064 | 0.0083 |   25.5 | B                                                                        |
| 5158.951 | 5158.777 | [Fe II]  |   | 10.1 | 21 | 0.0140 | 0.0182 |   56.7 | B                                                                        |
| 5158.956 | 5158.777 | [Fe II]  |   | 10.4 | 21 | 0.0113 | 0.0147 |   56.6 | R                                                                        |
| 5169.274 | 5169.033 | Fe II    |   | 14.0 | 13 | 0.0014 | 0.0018 |   10.8 | R possibly pumped; strongest line in multiplet; other possible 5018.440  |
| 5169.288 | 5169.033 | Fe II    |   | 14.8 | 10 | 0.0011 | 0.0014 |    8.8 | B                                                                        |
| 5191.700 | 5191.816 | [Ar III] |   | -6.7 | 14 | 0.0127 | 0.0164 |   63.7 | R average                                                                |
| 5198.159 | 5197.902 | [N I]    |   | 14.8 | 11 | 0.0203 | 0.0262 |  291.8 | R                                                                        |
| 5198.169 | 5197.902 | [N I]    |   | 15.4 | 11 | 0.0253 | 0.0327 |  287.0 | B                                                                        |
| 5200.516 | 5200.257 | [N I]    |   | 14.9 | 12 | 0.0119 | 0.0154 |  168.5 | R                                                                        |
| 5200.526 | 5200.257 | [N I]    |   | 15.5 | 11 | 0.0155 | 0.0200 |  175.3 | B                                                                        |
| 5219.353 | 5219.307 | S III    | ? |  2.6 | 18 | 0.0007 | 0.0009 |    3.9 | R                                                                        |
| 5219.359 | 5219.307 | S III    |   |  3.0 | 14 | 0.0009 | 0.0012 |    9.8 | B                                                                        |
| 5220.275 | 5220.059 | [Fe II]  | ? | 12.4 | 19 | 0.0011 | 0.0014 |    5.5 | R average                                                                |
| 5220.297 | 5220.059 | [Fe II]  |   | 13.7 | 20 | 0.0012 | 0.0015 |    9.9 | B                                                                        |
| 5261.854 | 5261.621 | [Fe II]  |   | 13.3 | 15 | 0.0107 | 0.0136 |   38.2 | B possible contribution from Ca I 5261.704 ^{3}D-^{3 }P                     |
| 5261.856 | 5261.621 | [Fe II]  |   | 13.4 | 13 | 0.0088 | 0.0112 |   71.3 | R possible contribution from Ca I 5261.704 ^{3}D-^{3 }P                     |
| 5269.228 | 5268.874 | [Fe II]  | ? | 20.2 | 20 | 0.0007 | 0.0009 |    4.1 | R                                                                        |
| 5270.530 |  5270.40 | [Fe III] |   |  7.4 | 15 | 0.0638 | 0.0812 |  335.1 | R average; possible contribution from Ca I 5270.270 ^{3}D-^{ 3}P            |
| 5270.543 |  5270.40 | [Fe III] |   |  8.1 | 15 | 0.0649 | 0.0826 |  252.8 | B average; possible contribution from Ca I 5270.270 ^{3}D-^{ 3}P            |
| 5273.577 | 5273.346 | [Fe II]  |   | 13.2 | 16 | 0.0057 | 0.0073 |   35.3 | R average                                                                |
| 5273.598 | 5273.346 | [Fe II]  |   | 14.3 | 16 | 0.0053 | 0.0067 |   26.4 | B                                                                        |
| 5275.306 | 5275.123 | O I      |   |      | 19 | 0.0018 | 0.0023 |    8.5 | R average                                                                |
|          | 5275.166 | O I      |   |      |    |        |        |        | R                                                                        |
| 5275.339 | 5275.123 | O I      | ? |      | 20 | 0.0015 | 0.0019 |    6.3 | B cannot see on two-dimensional image                                    |
|          | 5275.166 | O i      | ? |      |    |        |        |        | B                                                                        |
| 5297.037 | 5296.829 | [Fe II]  | ? | 11.8 | 15 | 0.0006 | 0.0008 |    4.7 | R                                                                        |
| 5299.245 | 5299.044 | O I      |   |      | 16 | 0.0046 | 0.0058 |   36.1 | R                                                                        |
|          | 5299.088 | O I      |   |      |    |        |        |        | R                                                                        |
| 5299.252 | 5299.044 | O I      |   |      | 18 | 0.0055 | 0.0070 |   37.2 | B                                                                        |
|          | 5299.088 | O I      |   |      |    |        |        |        | B                                                                        |
| 5333.862 | 5333.646 | [Fe II]  |   | 12.2 | 17 | 0.0028 | 0.0035 |   20.9 | B                                                                        |
| 5333.866 | 5333.646 | [Fe II]  |   | 12.4 | 18 | 0.0025 | 0.0031 |   16.5 | R                                                                        |
| 5342.392 |          |          | ? |      | 14 | 0.0028 | 0.0035 |   26.5 | B                                                                        |
| 5342.395 |          |          | ? |      | 15 | 0.0026 | 0.0033 |   26.2 | R                                                                        |
| 5363.659 |  5363.34 | [Ni IV]  | ? | 17.9 | 15 | 0.0014 | 0.0017 |   10.4 | B                                                                        |
| 5363.665 |  5363.34 | [Ni IV]  | ? | 17.9 | 11 | 0.0008 | 0.0010 |    8.4 | R                                                                        |
| 5376.606 | 5376.452 | [Fe II]  |   |  8.6 | 40 | 0.0037 | 0.0046 |    8.4 | B same multiplet as 5159, 5262                                           |
| 5376.646 | 5376.452 | [Fe II]  |   | 10.8 | 23 | 0.0023 | 0.0029 |   12.1 | R average; fuzzy on two-dimensional image                                |
| 5412.130 |  5411.98 | [Fe III] |   |  8.3 | 18 | 0.0068 | 0.0084 |   30.3 | B                                                                        |
| 5412.149 |  5411.98 | [Fe III] |   |  9.4 | 13 | 0.0062 | 0.0077 |   42.9 | R                                                                        |
| 5432.762 | 5432.797 | S II     | ? | -1.9 | 14 | 0.0009 | 0.0011 |    6.9 | B                                                                        |
| 5432.824 | 5432.797 | S II     | ? |  1.5 | 15 | 0.0012 | 0.0015 |    6.2 | R same multiplet as 5453.855                                             |
| 5433.365 | 5433.129 | [Fe II]  |   | 13.0 | 15 | 0.0018 | 0.0022 |    7.6 | R average; same multiplet as 5273                                        |
| 5433.369 | 5433.129 | [Fe II]  |   | 13.3 | 20 | 0.0017 | 0.0021 |   10.1 | B                                                                        |
| 5453.843 | 5453.855 | S II     |   | -0.7 | 13 | 0.0013 | 0.0016 |    9.1 | R same multiplet as 5432.797                                             |
| 5453.853 | 5453.855 | S II     |   | -0.1 | 11 | 0.0012 | 0.0015 |   11.4 | B                                                                        |
| 5495.626 | 5495.655 | N II     |   | -1.6 | 24 | 0.0019 | 0.0023 |    9.2 | B, gh                                                                    |
| 5495.640 | 5495.655 | N II     |   | -0.8 | 15 | 0.0013 | 0.0016 |   14.9 | R several weak lines of this multiplet possibly observed                 |
| 5506.859 | 5506.778 | Fe I     | ? |      | 10 | 0.0005 | 0.0006 |    5.3 | R                                                                        |
|          |  5507.00 | S I      | ? |      |    |        |        |        | R                                                                        |
| 5512.978 | 5512.772 | O I      |   |      | 16 | 0.0035 | 0.0043 |   40.2 | R average; ID lambda is average of sextet with all lines within 0.2A     |
|          | 5512.820 | O I      |   |      |    |        |        |        | R                                                                        |
|          | 5512.980 | Ca I     |   |      |    |        |        |        | R                                                                        |
| 5512.994 | 5512.772 | O I      |   |      | 16 | 0.0038 | 0.0046 |   14.3 | B wavelength is approximate, averaged for several lines in the multiplet |
|          | 5512.820 | O I      |   |      |    |        |        |        | B                                                                        |
|          | 5512.980 | Ca I     |   |      |    |        |        |        | B                                                                        |
| 5517.675 |  5517.66 | [Cl III] |   |      | 14 | 0.0810 | 0.0984 |  456.3 | R average, blended with weak line                                        |
|          |  5517.66 | [Ni IV]  |   |      |    |        |        |        | R                                                                        |
| 5517.680 |  5517.66 | [Cl III] |   |      | 14 | 0.0832 | 0.1011 |  258.4 | B blended with weak line                                                 |
|          |  5517.66 | [Ni IV]  |   |      |    |        |        |        | B                                                                        |
| 5518.354 | 5518.102 | N I      | ? |      | 14 | 0.0047 | 0.0057 |    8.9 | B average, blend with strong line                                        |
|          | 5518.576 | N I      | ? |      |    |        |        |        | B average                                                                |
| 5518.342 | 5518.102 | N I      | ? |      | 14 | 0.0050 | 0.0061 |   26.9 | R                                                                        |
|          | 5518.576 | N I      | ? |      | 14 |        |        |        | R average, blend with strong line                                        |
| 5527.508 |          |          |   |      | 21 | 0.0027 | 0.0033 |   16.7 | R not seen in blue spectrum                                              |
| 5535.357 | 5535.347 | N II     | ? |      | 24 | 0.0012 | 0.0015 |    5.3 | R                                                                        |
|          | 5535.353 | C II     | ? |      |    |        |        |        | R                                                                        |
|          | 5535.383 | N II     | ? |      |    |        |        |        | R several weak lines of this multiplet are possibly observed             |
| 5537.829 |   5537.7 | [Cl III] |   |      | 17 | 0.1257 | 0.1522 |  701.9 | B                                                                        |
| 5537.830 |   5537.7 | [Cl III] |   |      | 14 | 0.1220 | 0.1477 |  856.1 | R average                                                                |
| 5551.843 | 5551.922 | N II     |   | -4.3 | 20 | 0.0014 | 0.0017 |    8.6 | R several weak lines of this multiplet are possibly observed             |
| 5551.901 | 5551.922 | N II     |   | -1.1 | 19 | 0.0014 | 0.0017 |    8.1 | B                                                                        |
| 5555.209 | 5555.004 | O I      |   |      | 19 | 0.0055 | 0.0066 |   32.2 | B                                                                        |
|          | 5555.053 | O I      |   |      |    |        |        |        | B                                                                        |
| 5555.224 | 5555.004 | O I      |   |      | 17 | 0.0050 | 0.0060 |   24.8 | R average                                                                |
|          | 5555.053 | O I      |   |      |    |        |        |        | R                                                                        |
| 5577.523 | 5577.339 | [O I]    |   |  9.9 | 22 | 0.0028 | 0.0034 |   16.4 | B                                                                        |
| 5577.537 | 5577.339 | [O I]    |   | 10.7 | 20 | 0.0028 | 0.0034 |   15.6 | R                                                                        |
| 5606.145 | 5606.151 | S II     | ? | -0.3 | 11 | 0.0005 | 0.0006 |    6.0 | B strongest line in multiplet                                            |
| 5666.606 |  5666.63 | N II     | ? | -1.3 | 15 | 0.0045 | 0.0053 |    6.3 | B                                                                        |
| 5666.619 |  5666.63 | N II     |   | -0.6 | 15 | 0.0063 | 0.0075 |   55.3 | R                                                                        |
| 5675.990 |  5676.02 | N II     |   | -1.6 | 25 | 0.0038 | 0.0045 |    9.5 | B                                                                        |
| 5676.000 |  5676.02 | N II     |   | -1.1 | 15 | 0.0024 | 0.0028 |   21.9 | R                                                                        |
| 5679.542 |  5679.56 | N II     |   | -1.0 | 18 | 0.0088 | 0.0104 |   30.2 | B                                                                        |
| 5679.551 |  5679.56 | N II     |   | -0.5 | 15 | 0.0088 | 0.0104 |   80.1 | R                                                                        |
| 5686.178 |  5686.21 | N II     | ? | -1.7 | 17 | 0.0018 | 0.0021 |    7.1 | B                                                                        |
| 5686.198 |  5686.21 | N II     |   | -0.6 | 13 | 0.0016 | 0.0019 |   15.0 | R                                                                        |
| 5710.736 |  5710.77 | N II     |   | -1.8 | 18 | 0.0020 | 0.0023 |   12.0 | B                                                                        |
| 5710.757 |  5710.77 | N II     |   | -0.7 | 13 | 0.0018 | 0.0021 |   14.3 | R                                                                        |
| 5739.691 |  5739.73 | Si III   |   | -2.0 | 13 | 0.0047 | 0.0055 |   44.9 | R                                                                        |
| 5739.699 |  5739.73 | Si III   |   | -1.6 | 14 | 0.0049 | 0.0057 |   42.3 | B                                                                        |
| 5747.190 | 5746.966 | [Fe II]  | ? | 11.7 | 17 | 0.0007 | 0.0008 |    5.5 | B                                                                        |
| 5754.663 |  5754.59 | [N II]   |   |  3.8 | 18 | 0.1727 | 0.2014 |  974.0 | R average                                                                |
| 5754.664 |  5754.59 | [N II]   |   |  3.9 | 19 | 0.1693 | 0.1974 | 1162.2 | B                                                                        |
|----------+----------+----------+---+------+----+--------+--------+--------+--------------------------------------------------------------------------|
|          |          |          |   |      |    |        | 1.4545 |        |                                                                          |
#+TBLFM: @98$8=vsum(@I..@II)
+ Total line strength is about 1 x that of the reference line (is that H\beta?)
  + We need to be careful with double counting, since many lines are observed in both the red and the blue arm
  + No, it is 6678 and H\beta has 24.2016, so we have a total of about 4% of H\beta
  + So the total EW(lines) is about 16 \AA for EW(H\beta) = 400 \AA
  + The filter width is 650 \AA, so line contamination is 2.5%


**** FQ634N 6317-6381
Note that [S III] is just outside - need to check transmission there

| 6312.075 |  6312.06 | [S III] |   |  0.7 | 14 | 0.4755 | 0.5050 | 2908.8 | average        |
| 6347.147 |  6347.11 | Si II   |   |  1.8 | 20 | 0.0420 | 0.0444 |  227.4 | average        |
| 6364.011 | 6363.776 | [O I]   |   | 11.1 | 16 | 0.0621 | 0.0654 |  469.5 | average        |
| 6365.433 |  6365.10 | [Ni II] |   |      | 10 | 0.0020 | 0.0021 |   20.9 | average        |
| 6371.396 |  6371.37 | Si II   |   |  1.2 | 19 | 0.0212 | 0.0223 |  153.1 | average; blend |


**** F645N 6412-6496
| 6402.273 | 6402.246 | Ne I    | ? | 1.3 | 13 | 0.0018 | 0.0019 | 17.7 | identified by Esteban 1998 |
| 6440.522 | 6440.400 | [Fe II] | ? | 5.7 | 19 | 0.0005 | 0.0005 |  4.6 |                            |
| 6461.836 |          |         |   |     | 14 | 0.0060 | 0.0062 | 39.2 | average                    |


*** Just the filters we use

Bob says in the Ring paper...

: We adopted the pre-launch determined values of W from Table 6.2 of the
: WFC3 Instrument Handbook, except increasing the values slightly
: because of the broadening due to short wavelength shift of the filter
: profile. The amount of the shift was guided by the determination from
: emission-lines falling on the short wavelength portion of the filter
: profile described below. The adopted values of W were FQ436N (4.5 nm),
: FQ437N (3.3 nm), F469N (5.31 nm), F487N (6.2 nm), FQ575N (2.06 nm),
: FQ672N (2.21 nm), F673N (12.31 nm), and FQ674N (2.11 nm). It was not
: necessary to adopt a value of W for F502N, F656N, and F658N because
: the observed continuum was so weak that the continuum correction was
: less than 0.01).

Which gives ...

| Name   | Description      | Pivot λp (nm) | Width (nm) | Peak System Throughput | EW (Ang) | EW/EW547 | W/W547 |
| 1      | 2                |             3 |          4 |                      5 |        6 |        7 |      8 |
|--------+------------------+---------------+------------+------------------------+----------+----------+--------|
| FQ437N | [O III] 4363     |         437.1 |       3.30 |                   0.20 |      6.6 |   0.0391 | 0.0508 |
| F469N  | He II 4686       |         468.8 |       5.31 |                   0.20 |     10.6 |   0.0627 | 0.0817 |
| F487N  | Hβ 4861          |         487.1 |       6.20 |                   0.25 |     15.5 |   0.0917 | 0.0954 |
| F502N  | [O III] 5007     |         501.0 |       6.50 |                   0.26 |     16.9 |   0.1000 | 0.1000 |
| F547M  | Strömgren y      |         544.7 |      65.00 |                   0.26 |    169.0 |   1.0000 | 1.0000 |
| FQ575N | [N II] 5754      |         575.8 |       2.06 |                   0.23 |      4.7 |   0.0278 | 0.0317 |
| F656N  | Hα 6562          |         656.1 |       1.80 |                   0.24 |      4.3 |   0.0254 | 0.0277 |
| F658N  | [N II] 6583      |         658.4 |       2.80 |                   0.26 |      7.3 |   0.0432 | 0.0431 |
| FQ672N | [S II] 6717      |         671.6 |       2.21 |                   0.25 |      5.5 |   0.0325 | 0.0340 |
| F673N  | [S II] 6717/6731 |         676.6 |      12.31 |                   0.25 |     30.8 |   0.1822 | 0.1894 |
| FQ674N | [S II] 6731      |         673.1 |       2.11 |                   0.19 |      4.0 |   0.0237 | 0.0325 |
#+TBLFM: $6=10 $-1 $-2; f1::$7=$-1/@7$-1; f4::$8=$4/@7$4;f4

+ For the most part, the transmission profiles are very square, but F547M has a significant slope: from 0.26 at 525 nm to 0.19 at 580 nm.
  + This does not affect the nominal width, which is EW/peak
  + But it means that there will be a color term in the filter sensitivity
  + Variation is about 20%


**** Notes to the table columns

Columns 1-4 are described below. 

6 - EW is Width times Peak Throughput (in Angstroms for a change).

7 - EW normalised to the F547M filter

8 - Same as previous, but for the nominal widths instead

*** All filter characteristics from the WFC3 Instrument Handbook


From http://www.stsci.edu/hst/wfc3/documents/handbooks/currentIHB/c06_uvis06.html

Table 6.2: WFC3/UVIS Filters and Grism


*** UVIS Long-Pass (LP) and Extremely Wide (X) Filters

| Name   | Description                        | Pivot λp (nm) | Width (nm) | Peak System Throughput |
| 1      | 2                                  |             3 |          4 |                        |
|--------+------------------------------------+---------------+------------+------------------------|
| F200LP | Clear                              |         488.3 |      502.2 |                   0.33 |
| F300X  | Extremely wide UV; grism reference |         280.7 |       66.3 |                   0.17 |
| F350LP | Long pass                          |         584.6 |      475.8 |                   0.29 |
| F475X  | Extremely wide blue                |         493.9 |      205.6 |                   0.28 |
| F600LP | Long pass                          |         744.4 |      229.2 |                   0.29 |
| F850LP | SDSS z′                            |         916.6 |      118.2 |                   0.09 |

*** UVIS Wide-Band (W) Filters

| Name  | Description    | Pivot λp (nm) | Width (nm) | Peak System Throughput |
| 1     | 2              |             3 |          4 |                        |
|-------+----------------+---------------+------------+------------------------|
| F218W | ISM feature    |         222.4 |       32.2 |                   0.05 |
| F225W | UV wide        |         235.9 |       46.7 |                   0.10 |
| F275W | UV wide        |         270.4 |       39.8 |                   0.13 |
| F336W | U, Strömgren u |         335.5 |       51.1 |                   0.20 |
| F390W | Washington C   |         392.1 |       89.6 |                   0.25 |
| F438W | WFPC2 B        |         432.5 |       61.8 |                   0.24 |
| F475W | SDSS g′        |         477.3 |      134.4 |                   0.27 |
| F555W | WFPC2 V        |         530.8 |      156.2 |                   0.28 |
| F606W | WFPC2 Wide V   |         588.7 |      218.2 |                   0.29 |
| F625W | SDSS r′        |         624.2 |      146.3 |                   0.28 |
| F775W | SDSS i′        |         764.7 |      117.1 |                   0.23 |
| F814W | WFPC2 Wide I   |         802.4 |      153.6 |                   0.23 |
|       |                |               |            |                        |

*** UVIS Medium-Band (M) Filters

| Name   | Description     | Pivot λp (nm) | Width (nm) | Peak System Throughput |
| 1      | 2               |             3 |          4 |                        |
|--------+-----------------+---------------+------------+------------------------|
| F390M  | Ca II continuum |         389.7 |       20.4 |                   0.22 |
| F410M  | Strömgren v     |         410.9 |       17.2 |                   0.27 |
| FQ422M | Blue continuum  |         421.9 |       11.2 |                   0.19 |
| F467M  | Strömgren b     |         468.3 |       20.1 |                   0.28 |
| F547M  | Strömgren y     |         544.7 |       65.0 |                   0.26 |
| F621M  | 11% passband    |         621.9 |       60.9 |                   0.28 |
| F689M  | 11% passband    |         687.6 |       68.3 |                   0.25 |
| F763M  | 11% passband    |         761.2 |       70.4 |                   0.21 |
| F845M  | 11% passband    |         843.6 |       78.7 |                   0.14 |
|        |                 |               |            |                        |

*** UVIS Narrow-Band (N) Filters

| Name   | Description            | Pivot λp (nm) | Width (nm) | Peak System Throughput |
| 1      | 2                      |             3 |          4 |                        |
|--------+------------------------+---------------+------------+------------------------|
| FQ232N | C II] 2326             |         241.3 |        3.4 |                   0.04 |
| FQ243N | [Ne IV] 2425           |         246.8 |        3.6 |                   0.05 |
| F280N  | Mg II 2795/2802        |         283.1 |        4.3 |                   0.06 |
| F343N  | [Ne V] 3426            |         343.5 |       25.0 |                   0.21 |
| F373N  | [O II] 3726/3728       |         373.0 |        5.0 |                   0.18 |
| FQ378N | z ([O II] 3726)        |         379.2 |        9.9 |                   0.20 |
| FQ387N | [Ne III] 3868          |         387.4 |        3.4 |                   0.18 |
| F395N  | Ca II 3933/3968        |         395.5 |        8.5 |                   0.22 |
| FQ436N | Hγ 4340 + [O III] 4363 |         436.7 |        4.3 |                   0.19 |
| FQ437N | [O III] 4363           |         437.1 |        3.0 |                   0.20 |
| F469N  | He II 4686             |         468.8 |        5.0 |                   0.20 |
| F487N  | Hβ 4861                |         487.1 |        6.0 |                   0.25 |
| FQ492N | z (Hβ)                 |         493.3 |       11.4 |                   0.25 |
| F502N  | [O III] 5007           |         501.0 |        6.5 |                   0.26 |
| FQ508N | z ([O III] 5007)       |         509.1 |       13.1 |                   0.26 |
| FQ575N | [N II] 5754            |         575.8 |        1.8 |                   0.23 |
| FQ619N | CH4 6194               |         619.9 |        6.1 |                   0.26 |
| F631N  | [O I] 6300             |         630.4 |        5.8 |                   0.25 |
| FQ634N | 6194 continuum         |         634.9 |        6.4 |                   0.26 |
| F645N  | Continuum              |         645.4 |        8.4 |                   0.25 |
| F656N  | Hα 6562                |         656.1 |        1.8 |                   0.24 |
| F657N  | Wide Hα + [N II]       |         656.7 |       12.1 |                   0.26 |
| F658N  | [N II] 6583            |         658.4 |        2.8 |                   0.26 |
| F665N  | z (Hα + [N II])        |         665.6 |       13.1 |                   0.26 |
| FQ672N | [S II] 6717            |         671.6 |        1.9 |                   0.25 |
| F673N  | [S II] 6717/6731       |         676.6 |       11.8 |                   0.25 |
| FQ674N | [S II] 6731            |         673.1 |        1.8 |                   0.19 |
| F680N  | z (Hα + [N II])        |         687.7 |       37.1 |                   0.25 |
| FQ727N | CH4 7270               |         727.5 |        6.4 |                   0.21 |
| FQ750N | 7270 continuum         |         750.3 |        7.0 |                   0.18 |
| FQ889N | CH4 25 km-agt5         |         889.2 |        9.8 |                   0.10 |
| FQ906N | CH4 2.5 km-agt         |         905.8 |        9.9 |                   0.08 |
| FQ924N | CH4 0.25 km-agt        |         924.8 |        9.2 |                   0.08 |
| FQ937N | CH4 0.025 km-agt       |         937.2 |        9.3 |                   0.07 |
| F953N  | [S III] 9532           |         953.0 |        9.7 |                   0.05 |
|        |                        |               |            |                        |


*** Column descriptions

1. The spectral-element naming convention is as follows for both the
   UVIS and IR channels. All filter names begin with F, and grisms
   with G; if the filter is part of a four-element quad mosaic, a Q
   follows F. Then there is a three-digit number giving the nominal
   effective wavelength of the bandpass, in nm (UVIS channel) or nm/10
   (IR channel). (For long-pass filters, the number is instead the
   nominal blue cut-off wavelength in nm.) Finally, for the filters,
   one or two letters indicate the bandpass width: X (extremely wide),
   LP (long pass), W (wide), M (medium), or N (narrow).

2. Filters intended for imaging in a red-shifted bandpass are given
   descriptions similar to the following: “z (Hα + [N II])”.

3. “Pivot wavelength” is a measure of the effective wavelength of a
   filter (see Section 9.3 and Tokunaga & Vacca 2005, PASP, 117,
   421). It is calculated here based on the integrated system
   throughput. Filter transmissions were measured in air, but the
   equivalent vacuum wavelengths are reported in this table.

4. Widths listed are passband rectangular width, defined as the
   equivalent width divided by the maximum throughput within the
   filter bandpass. Equivalent width is the integral with respect to
   wavelength of the throughput across the filter passband.



* Bob's formulae for the filter calibrations

** FQ575N

\[
r_{\mathrm{pred}} = 1 + \left[50.44 k^{-1} \frac{R_{\mathrm{F575N}}}{R_{\mathrm{F547M}}} - 1\right]^{-1}
\]


* Export options						   :noexport:
#+TITLE:     Orion t^2 project
#+AUTHOR:    William Henney
#+EMAIL:     w.henney@crya.unam.mx
#+DESCRIPTION:
#+KEYWORDS:
#+LANGUAGE:  en
#+OPTIONS:   H:5 num:nil toc:t \n:nil @:t ::t |:t ^:{} -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+INFOJS_OPT: view:nil toc:nil ltoc:t mouse:underline buttons:0 path:http://orgmode.org/org-info.js
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LINK_UP:   
#+LINK_HOME: 
#+XSLT:

